Бертран Марьер 

Цель: Найти критерии качественого ПО, и изучить методы напиания кода для создания офта ответтвующего критериям качетвеного ПО

Глава тр 30-40

Автор указывает, что ущетвуют внешние и внутрение критерии качетва ПО.

Внутрее качетва ПО влияют на пециалитов работующих  по на уровне кода. Внешнии в взаимодетвие  по на уровне пользователя 

Внешнии критерии 

Корректность (Correctness)
Определение: корректность	
пообноть ПО обьективно выполнять задачи в оответтвии о пецификацией 


Устойчивость (Robustness)
Определение: устойчивость

Второе возможноть ПО здраво реагировать на вызовы и ЧП. 

Это дотигаетя , через иключении? При этом включить ожидание чп в по . Это уже не отноитя к авариной итуации(Вод не верного пароля)


